start("让 铁 傀 儡 陪 你 一 起 撸 铁 吧！",(3,0,0))

def mass_gainer():
    do("拿好材料",["增肌粉","一盒牛奶","摇摇杯","摇摇杯清洗工具"])
    do("用水冲一下摇摇杯")
    do("配制悬浊液",["把一盒牛奶、一勺增肌粉添加到摇摇杯中","盖紧杯盖","摇晃摇摇杯30秒"])
    do("把增肌粉喝下去")
    do("清洗摇摇杯",["用清洗工具刮掉残余物质","多用水清一清"])
pt=do('预约私教课')
state=ask("你现在的状态？",("饱了","不饿","饿了"))
if state in ["不饿","饿了"]:
    if ask("练之前准备吃增肌粉吗？")=="是":
        mass_gainer()
    else:
        if not do("练之前吃点东西",["可以吃正常的一顿饭","也可以买两个牛肉包吃"]) and state=="饿了":
            say("你不能在饿肚子的情况下去训练！")
            exit()
if pt:
    do("跟私教沟通今天要做的动作")
do("预习今天要做的动作")
do("换衣服",["穿运动鞋","换运动衣(T恤衫/背心)","穿运动裤(注意确保活动自由度)"])            
shower=ask("准备在健身房洗澡吗？")
if shower=="是": do('带好洗澡用品',['洗面奶','肥皂(需要有肥皂盒)','沐浴露','洗发膏','两条干净毛巾','干净的内裤','干净的内衣','干净的袜子'])
belongings=['水杯','湿巾','钥匙','手机','口罩','餐巾纸','蓝牙耳机']
do("拿好随身物品",belongings)
do("出发去健身房")
l1=['只穿运动衣裤、运动鞋']
if not pt=="是":
    l1.extend(['只拿水杯、汗巾、手机','手机用于确认进度，锻炼过程中不要玩手机'])
else:
    l1.append('只拿水杯、汗巾')
do('寄存物品，脱去衣服',l1)
if pt:
    do("上私教课")
else:
    do("运动前准备",["热身准备(活动关节)","肌肉拉伸(减少肌肉粘滞性)"])
    do("力量练习",["可在组与组之间对目标肌肉进行拉伸"])
    if ask("你需要减脂吗？")=="是":
        do("有氧训练",["在跑步机、椭圆机、动感单车等机器上训练"])
    do("整理运动",["静态拉伸，不要弹动","每个部分可以重复2~3次，每次维持15~30秒钟。"])
do("休息一会儿，玩会手机",["直到不再出汗为止"])
if shower:
    if ask("浴室是否有热水？")=="是":
        do("脱衣洗澡")
        do("穿上衣服")
do("带好所有随身物品")
do("离开健身房，去轻食店")
do("点餐并用餐")
do("回家")
if ask("想喝增肌粉吗？")=="是":
    mass_gainer()