#import os

start('准 备 好 变 成 靓 仔 了 吗？', (3, 0, 0))

supply=False
is_eaten=ask('刚刚吃过了吗？')
if do('出门'):
    do('给充电宝接上充电器')
    do('做头发快剪')
    if is_eaten=='是':
        supply=do('买咖啡')
    else:
        supply=do('买咖啡和面包')

if ask('手机是否已充满电？')=='否': do('给手机接上充电器')
if supply:
    if ask('咖啡是热的吗？') == '否':
        do('加热咖啡')
    if is_eaten=='否':
        if ask('面包是热的吗？') == '否':
            do('加热面包')
        do('吃面包的同时喝咖啡')
    else:
        do('喝咖啡')

if ask('手机是否已充满电？')=='否': do('给手机接上充电器')

# 清洁卫生
do('刷牙', ['持续2分钟时间','可以使用漱口水清新口气'])
do('找衣服',['按dress code找到外衣','根据气温决定是否加毛衣','找好内裤和内衣'])
do('洗澡', ['洗面奶','肥皂','沐浴露','洗发膏','干毛巾','干净的内裤','干净的内衣','塑料拖鞋'])
do('穿上衣服')
do('护肤', ['拍爽肤水', '涂防晒霜', '涂素颜霜', '涂BB霜'])
if ask('洗澡的时候洗头了吗？')=='是':
    do('吹头发')
do('剃胡须')
do('剪指甲', ['手指', '脚趾'])
do('喷防晒喷雾')
do('喷香水', ['一喷于脖子处','一喷于手腕处'])
do('涂润唇膏')
do('洗掉换下来的脏衣服')


# 饰品
if ask('手机是否已充满电？')=='否': do('给手机接上充电器')
if ask('想要有纹身图案吗？') == '是':
    do('贴纹身贴')
if ask('你有耳洞吗？') == '是':
    do('戴耳环')
glasses = ask('想带眼镜吗？')
if glasses == '是':
    do('戴眼镜')
if ask('想戴项链吗？')=='是':
    do('戴项链')

# 去撩妹？
if ask('手机是否已充满电？')=='否': do('给手机接上充电器')
if ask('是否进行街头搭讪？')=='是':
    do('街头搭讪预演',['先默念台词','对着镜子管理好表情','不要显得太饥渴'])

if ask('晚上去不去酒吧？')=='是':
    do('酒吧搭讪预演',['先默念台词','对着镜子管理好表情','不要显得太饥渴'])


# 随身物品
belongings = ['餐巾纸','口罩','手机','钥匙','矿泉水','充电宝']
if glasses == '是':
    belongings.append('眼镜盒')
if ask('是否要去逛街？')=='是':
    belongings.append('购物袋')
    if ask('你是学生吗？')=='是':
        belongings.append('学生证')
if ask('今天准备OOXX吗？') == '是':
    belongings.extend(['身份证', '避孕套', '润滑液'])


do('检查随身物品，出门', belongings)
finish()
